[
  {
    "id": 460,
    "make": "Hot Toys",
    "productCode": "MMS460",
    "productName": "Black Widow",
    "productLine": "Avengers: Infinity War",
    "description": "Everything the Avengers have fought for has led up to this moment – the fate of Earth and existence itself has never been more uncertain. Black widow, who is one of the deadliest spies in the world, will find herself once again assemble with the Avengers when the greatest cosmic threat ever known descends on Earth.\n\nTo get fans ready for the highly anticipated Marvel Studios’ Avengers: Infinity War, Hot Toys is excited to officially introduce today the new 1/6th scale collectible figure Black Widow! \nMade with meticulous craftsmanship, the movie accurate collectible is beautifully crafted with striking likeness of Black Widow’s appearance portrayed by Scarlett Johansson in the film, the collectible figure features a newly painted head sculpt with mid-length ash blonde real fabric hair, a beautifully tailored Black Widow’s latest outfit with fine detail textures and weathering effect, a variety of weapons including disk shooters, batons and a specially designed movie-themed figure stand.\n\nThe 1/6th scale Black Widow Collectible Figure specially features:\n– Newly painted head sculpt with authentic and detailed likeness of Scarlett Johansson as Black Widow in Avengers: Infinity War\n– Movie-accurate facial expression and make-up\n– Medium-length ash blonde real fabric hair implantation\n– Body with over 28 points of articulations\n– Approximately 28 cm tall\n– Eight (8) pieces of interchangeable gloved hands including:\n– One (1) pair of fists\n– One (1) pair of relaxed hands\n– One (1) pair of hands for holding disk shooters\n– One (1) pair of hands for holding batons\n– Each piece of head sculpt is specially hand-painted\n\nCostume :\n– One (1) one-piece black-colored jumpsuit with shoulder armor\n– One (1) pair of black-colored wrist guards with Widow’s Bite bracelets\n– One (1) dark green-colored tactical vest\n– One (1) black-colored belt with disk shooter holsters on thighs\n– One (1) pair of black-colored platform boots\n\nWeapons:\n– Two (2) disk shooters\n– Two (2) short batons\n– One (1) long baton\n\nAccessories:\n– One (1) non-detachable Baton backpack with two (2) Baton handles\n– Specially designed movie-themed figure stand and movie logo\n\nArtists:\n– Head Sculpted by Yulli\n– Head Painted by JC. Hong\n– Head Art Directed by JC. Hong\n\nRelease date: Approximately Q3 – Q4, 2018\n\n**Prototype shown, final product may be slightly different\n**Product details could be subjected to change without further notice\n\n© 2018 Marvel.\n© 2018 Hot Toys Limited. All Rights Reserved.",
    "imageUrl": "./assets/images/mms460-b21.jpg"
  },
  {
    "id": 473,
    "make": "Hot Toys",
    "productCode": "MMS473",
    "productName": "Iron Man",
    "productLine": "Avengers: Infinity War",
    "description": "A new threat has emerged from the cosmos and it became too heavy for any hero to handle! The Avengers must join forces to protect the world and to stop the ruthless warlord and his formidable allies from destroying the universe! Together with other significant superheroes, the latest Iron Man with advance technology that Tony Stark has created will fight against their ultimate villain Thanos!\n\nPrior to the release of the highly anticipated Avengers: Infinity War, Hot Toys is ecstatic to officially introduce the first collectible – the 1/6th scale Iron Man collective figure, among the first wave of Avengers: Infinity War collectible’s line-up.\n\nWith remarkable movie-accuracy, the 1/6th scale figure is expertly crafted based on Robert Downey Jr. as Tony Stark/Iron Man in Avengers: Infinity War, featuring an interchangeable helmeted head with metallic red, gold and silver colored armor painting and a newly painted head sculpt with striking likeness, LED light-up functions scattered throughout the armor, a variety of Iron Man’s latest weapons including interchangeable LED light-up Nano Repulsor Cannon, Hand Cannon on left arm, a pair of attachable Nano Boosters on the back, and specially designed figure stand with movie logo.\n\nThe 1/6th scale Iron Man Collectible Figure specially features:\n– Authentic and detailed likeness of Iron Man in Avengers: Infinity War\n– One (1) newly painted head sculpt with authentic likeness of Robert Downey Jr. as Tony Stark in the movie\n– Movie-accurate facial features with detailed beard, wrinkles and skin texture\n– One (1) interchangeable helmeted head with LED light-up function (white light, battery operated)\n– Approximately 32 cm tall\n– Over 30 points of articulations\n– Contains diecast material\n– Special features on armor:\n– Metallic red, gold and silver colored painting on the sleek and streamline Iron Man armor design\n– 21 LED light-up points throughout parts of the armor (white light, battery operated)\n– One (1) pair of articulated air flaps at back of the armor\n– One (1) detachable chest armor to reveal interior mechanical design\n– Three (3) pairs of interchangeable hands including:\n• One (1) pair of fists\n• One (1) pair of hands with articulated fingers and light-up repulsors (white light, battery operated)\n• One (1) pair of battle hands with light-up repulsor (white light, battery operated)\n– Articulations on waist armor which allow flexible movement\n– Each piece of head sculpt is specially hand-painted\n\nWeapons:\n– One (1) interchangeable LED light-up Nano Repulsor Cannoned right arm (white light, battery operated)\n– One (1) interchangeable Hand Cannon (left arm)\n– One (1) pair of attachable Nano Boosters on the back\n\nAccessory:\n– Specially designed Avengers: Infinity War themed hexagonal figure stand with movie logo\n\nArtists:\n– Head Sculpted by Kojun\n– Head Painted by JC. Hong & E-Lee\n– Head Art Directed by JC. Hong\n– Armor Painted by Lok Ho\n\nRelease date: Approximately Q1 – Q2, 2019\n\n**Prototype shown is not final. Pending licensor approval.\n**Battery included for collectible figure, button cells are required.\n**Product details could be subjected to change without further notice.\n\n© 2018 Marvel.\n© 2018 Hot Toys Limited. All Rights Reserved.",
    "imageUrl": "./assets/images/mms473-i29.jpg"
  },
  {
    "id": 474,
    "make": "Hot Toys",
    "productCode": "MMS474",
    "productName": "Thor",
    "productLine": "Avengers: Infinity War",
    "description": "The war between Avengers and villainous Thanos will finally hit the silver screen this upcoming May in Avengers: Infinity War. Superheroes will join force to fight Thanos, while the fate of the Earth and the Universe hangs in the balance! Fans around the world will witness the mighty God of Thunder to find himself confronting the unstoppable Thanos! Today, Hot Toys is pleased to officially introduce the 1/6th scale Thor collectible figure from Avengers: Infinity War!\n\nSophisticatedly crafted based on Chris Hemsworth’s appearance in the film with astonishing likeness, the Thor collectible figure features a newly developed head sculpt with specially applied luminous reflective effect on the eye that accentuates Thor using his thunder power, a newly developed muscular body with two pairs of interchangeable arms, intricately detailed body armor with LED light up circle plates and lightning effect accessories, a detachable red-colored cape, detail recreation of Thor’s new weapon Stormbreaker, and a specially designed figure stand with movie logo.\n\nThe 1/6th scale Thor Collectible Figure specially features:\n– Newly developed head sculpt with authentic and detailed likeness of Chris Hemsworth as Avengers: Infinity War\n– Specially applied luminous reflective effect on the eye to emulate Thor using his lightning power\n– Movie-accurate facial expression with detailed wrinkles, skin texture, scars, and beard\n– Brown color short hair sculpture\n– Approximately 32 cm tall\n– Newly developed muscular body with over 30 points of articulations\n– One (1) pair of interchangeable arms with seamless elbow joints\n– One (1) pair of interchangeable black and metal-colored armored arms\n– Four (4) pairs of interchangeable hands including:\n– One (1) pair of fists\n– One (1) pair of relaxed hands\n– One (1) pair of open hands\n– One (1) pair for holding weapons\n– Each piece of head sculpt is specially hand-painted\n\nCostume:\n– One (1) detachable red-colored cape\n– One (1) piece of newly developed black-colored body armor with black metal-colored circle plates\n– Six (6) pieces of detachable black metal-colored circle plates, LED light-up function (battery operated) on body armor with gradient blue colored lightning effect accessories\n– One (1) pair of black and metal-colored forearm armor\n– One (1) pair of black pants with patterned design on sides\n– One (1) pair of black colored boots\n\nWeapon:\n– One (1) Stormbreaker\n\nAccessories:\n– One (1) detachable black eye patch (equipped with magnetic feature)\n– Two (2) gradient blue colored lightning effect accessories\n– Specially designed Avengers: Infinity War themed hexagonal figure stand with movie logo\n\nArtists:\n– Head Sculpted by Jae-Sung, Eom\n– 3D Designed by Da-Hye, Kim\n– Head Painted by JC. Hong & E-Lee\n– Head Art Directed by JC. Hong\n\nRelease date: Approximately Q4, 2018 – Q1, 2019\n\n**Prototype shown, final product may be slightly different\n**Battery included for collectible figure, button cells are required\n**Product details can subject to change without further notice\n\n© 2018 Marvel.\n© 2018 Hot Toys Limited. All Rights Reserved.",
    "imageUrl": "./assets/images/mms474-t20.jpg"
  },
  {
    "id": 475,
    "make": "Hot Toys",
    "productCode": "MMS475",
    "productName": "Groot",
    "productLine": "Avengers: Infinity War",
    "description": "Get ready for the return of Rocket and Groot in the upcoming epic release Avengers: Infinity War, which will unveil a first look of the Guardians teaming up with the Avengers! Fans are eagerly anticipating on how Groot continues to prove himself as a dependable hero while battling alongside with his comrade Rocket!\n\nToday, Hot Toys is delighted to present the 1/6th scale collectible set of Groot and Rocket from Marvel’s forthcoming film Avengers: Infinity War.\n\nThe newly developed Groot is expertly crafted based on his appearance in the film, featuring a finely sculpted head with 2 interchangeable face sculpts, impressive paint application on his body reflecting his distinctive appearance, blaster rifle, handheld game console and a movie-themed figure stand with movie logo.\n\nThe 1/6th scale Groot Collectible Figure specially features:\n– Authentic and detailed likeness of Groot in Marvel Studios’ Avengers: Infinity War\n– Two (2) newly developed interchangeable face sculpts with movie-accurate facial expression and tree texture\n– Approximately 29.5 cm tall\n– Newly developed unique body with over 15 points of articulations\n– Five (5) pieces of interchangeable hands including:\n– One (1) pair of relaxed hands\n– One (1) partially clenched left hand\n– One (1) weapon holding right hand\n– One (1) attacking right hand\n– Each piece of face sculpt is specially hand-painted\n\nWeapon:\n– One (1) blaster rifle\n\nAccessories:\n– One (1) handheld game console\n– Specially designed movie-themed figure stand movie logo\n\nArtists:\n– Figure Sculpted by Joseph Tsang\n– Figure Painted by Lok Ho\n\nRelease date: Approximately Q4, 2018 – Q1, 2019\n\n**Prototype shown, final product may be slightly different\n**Product details are subject to change without further notice\n\n© 2018 Marvel.\n© 2018 Hot Toys Limited. All Rights Reserved.",
    "imageUrl": "./assets/images/mms475-g17.jpg"
  },
  
  {
    "id": 476,
    "make": "Hot Toys",
    "productCode": "MMS476",
    "productName": "Groot & Rocket",
    "productLine": "Avengers: Infinity War",
    "description": "Get ready for the return of Rocket and Groot in the upcoming epic release Avengers: Infinity War, which will unveil a first look of the Guardians teaming up with the Avengers! Fans are eagerly anticipating on how Groot continues to prove himself as a dependable hero while battling alongside with his comrade Rocket!\n\nToday, Hot Toys is delighted to present the 1/6th scale collectible set of Groot and Rocket from Marvel’s forthcoming film Avengers: Infinity War.\n\nThe newly developed Groot is expertly crafted based on his appearance in the film, featuring a finely sculpted head with 2 interchangeable face sculpts, impressive paint application on his body reflecting his distinctive appearance, blaster rifle, handheld game console and a movie-themed figure stand with movie logo.\n\nThe movie- accurate Rocket is specially crafted based on his unique physique in the film, it features a newly painted head portraying his roaring expression with remarkable likeness, specially tailored combat suit, interchangeable hands and feet, all-new highly detailed blaster rifle, and a specially designed movie-themed figure with movie logo.\n\nThe 1/6th scale Groot Collectible Figure specially features:\n– Authentic and detailed likeness of Groot in Marvel Studios’ Avengers: Infinity War\n– Two (2) newly developed interchangeable face sculpts with movie-accurate facial expression and tree texture\n– Approximately 29.5 cm tall\n– Newly developed unique body with over 15 points of articulations\n– Five (5) pieces of interchangeable hands including:\n– One (1) pair of relaxed hands\n– One (1) partially clenched left hand\n– One (1) weapon holding right hand\n– One (1) attacking right hand\n– Each piece of face sculpt is specially hand-painted\n\nWeapon:\n– One (1) blaster rifle\n\nAccessories:\n– One (1) handheld game console\n– Specially designed movie-themed figure stand movie logo\n\nArtists:\n– Figure Sculpted by Joseph Tsang\n– Figure Painted by Lok Ho\n\nThe 1/6th scale Rocket Collectible Figure specially features:\n– Newly painted roaring expression head sculpt with authentic and detailed likeness of Rocket from Avengers: Infinity War\n– Movie-accurate facial expression and detail fur texture\n– Approximately 16 cm tall\n– Specialized body with over 17 points of articulations\n– Three (3) pairs of interchangeable hands including:\n– One (1) pair of relaxed hands\n– One (1) pair of fists\n– One (1) pair of hands for holding blaster rifle\n– Two (2) pairs of interchangeable feet including:\n– One (1) pair of feet for standing\n– One (1) pair of feet in a flying stance\n– Each piece of head sculpt is specially hand- painted\n\nCostume:\n– One (1) navy blue space suit\n– One (1) utility belt with pouches\n– One (1) gun strap (wearable on the back)\n\nWeapon:\n– One (1) blaster rifle\n\nAccessory:\n– Specially designed movie-themed figure stand movie logo\n\nArtists:\n– Head Sculpted by So-young, Lee\n– Painted by JC. Hong\n– Head Art Directed by JC. Hong\n\nRelease date: Approximately Q4, 2018 – Q1, 2019\n\n**Prototype shown, final product may be slightly different\n**Product details are subject to change without further notice\n\n© 2018 Marvel.\n© 2018 Hot Toys Limited. All Rights Reserved.",
    "imageUrl": "./assets/images/mms476-gr21.jpg"
  }
]
